tests/integration/test_multiphaseRadiation_dorigon/foam_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     flameletCloudFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;

endTime         2e-3;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   2e-3;

purgeWrite      2;

writeFormat     ascii;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   16;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

maxDeltaT       5e-6;

clouds{
    coalCloud carbonaceousCloud;
    ashCloud carbonaceousCloud;
}

libs    
(
    "libradiationModelsSTFS.so"
    "libparticleRadiation.so" 
);

// ************************************************************************* //
functions
{
}
