tests/integration/test_multiphaseRadiation_dorigon/foam_template/constant/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
".*"
{
    type            opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type multiBandAbsorption;
        emissivity      (0.29 0.29 0.29 0.29 0.29);
        absorptivity    (0.29 0.29 0.29 0.29 0.29);
     }
}



// ************************************************************************* //
